OpenFOAM-v2112-AD/tutorials/lagrangian/reactingParcelFoam/liquidFilmStepWithSprinkles/system/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/faMesh";
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches  1( base );

boundary
{
    inlet
    {
        type                patch;
        ownerPolyPatch      base;
        neighbourPolyPatch  inlet;
    }

    outlet
    {
        type                patch;
        ownerPolyPatch      base;
        neighbourPolyPatch  outlet;
    }

    sides
    {
        type                patch;
        ownerPolyPatch      base;
        neighbourPolyPatch  sides;
    }
}


// ************************************************************************** //
